In [2]:
import numpy as np 
import pandas as pd 
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [2]:
mydat = pd.read_csv('Sri Venkateshwara College of Engineering and Technology_202015-11-19.csv')

In [3]:
mydat.head()

,Name,python,mysql,Previous Geekions,CodeKata Score,Department,Mobile,Email,Rising
0,A.Dharani,82.0,20.0,24500,24500,Computer Science and Engineering,8056669928,dharanianbu74@gmail.com,0
1,V.JEEVITHA,82.0,20.0,21740,21740,Computer Science and Engineering,9655705598,vjeevitha1998@gmail.com,0
2,HEMAVATHI.R,100.0,100.0,19680,19680,Computer Science and Engineering,7558186924,hemaravi0499@gmail.com,0
3,Mugunthan S,100.0,47.0,10610,10610,Computer Science and Engineering,7094532287,mugunthans718@gmail.com,0
4,Sathammai.S,100.0,8.0,8980,8980,Computer Science and Engineering,6374336788,vinayagar2324@gmail.com,0

In [4]:
prev_geek_mean = mydat['Previous Geekions'].mean()

In [5]:
prev_geek_mean

2904.5238095238096

In [6]:
pres_geek_mean = mydat['CodeKata Score'].mean()

In [7]:
pres_geek_mean

2906.0714285714284

In [9]:
myfram = mydat[['Name','CodeKata Score']]

In [10]:
myfram.head()

          Name  CodeKata Score
0    A.Dharani           24500
1  V.JEEVITHA            21740
2  HEMAVATHI.R           19680
3  Mugunthan S           10610
4  Sathammai.S            8980

In [11]:
Excellent = myfram[myfram['CodeKata Score']>=10000]

In [12]:
Excellent.to_csv('Exceeded_expectations.csv', encoding='utf-8', index=False)

In [13]:
Good = myfram[(myfram['CodeKata Score']<10000) & (myfram['CodeKata Score']>=8000)]

In [14]:
Good.to_csv('Reached_expectations.csv', encoding='utf-8', index=False)

In [15]:
Medium = myfram[(myfram['CodeKata Score']>=4000) & (myfram['CodeKata Score']<8000)]

In [16]:
Medium.to_csv('Needs_improvement.csv', encoding='utf-8', index=False)

In [17]:
Low = myfram[(myfram['CodeKata Score']<4000)]

In [18]:
Low.to_csv('Unsatisfactory.csv', encoding='utf-8', index=False)

In [19]:
pd.read_csv('Unsatisfactory.csv').head()

           Name  CodeKata Score
0      s.janani            3915
1  kamalishwari            3665
2       Yuvasri            3460
3        balaji            3280
4       MEERA.M            3200

In [20]:
pd.read_csv("Needs_improvement.csv").head()

                   Name  CodeKata Score
0         KALAIARASAN K            7880
1  MOHAMED ZUBAIR AHMED            7020
2            J.SUGANTHI            5860
3          thamizhpaana            5500
4       Iyappan Samiraj            5400

In [21]:
pd.read_csv('Reached_expectations.csv')

           Name  CodeKata Score
0   Sathammai.S            8980
1  NIVEESHWAR S            8200

In [22]:
pd.read_csv('Exceeded_expectations.csv')

          Name  CodeKata Score
0    A.Dharani           24500
1  V.JEEVITHA            21740
2  HEMAVATHI.R           19680
3  Mugunthan S           10610

In [25]:
myfram.isnull().sum()

Name              0
CodeKata Score    0
dtype: int64